# Exploracion Inicial

In [1]:
import pandas as pd
import numpy as np

## Leer archivos raw

In [4]:
cur = pd.read_excel('../data/raw/Cursadas-Alumnos-SIGA-v2.xlsx')
dat = pd.read_excel('../data/raw/Datos-Alumnos-SIGA-v2.xlsx')
fin = pd.read_excel('../data/raw/Finales-Alumnos-SIGA-v2.xlsx')

In [6]:
print('shape cur:' ,cur.shape)
print('shape dat:' ,dat.shape)
print('shape fin:' ,fin.shape)

shape cur: (812169, 12)
shape dat: (84395, 10)
shape fin: (1002745, 7)

In [7]:
cur.head()

,codigo_alumno,curso,codigo_materia,departamento,modalidad,turno,ciclo_lectivo,tipo_de_aprobacion,cantidad_recursada_regular,descripción_recursada_regular,cantidad_recursada_libre,descripción_de_recursada_libre
0,27,K5051,952037,NaN,Presencial,Noche,2006,"Regularidad, Promoción",0,NaN,0,NaN
1,27,K5052,952052,NaN,Presencial,Noche,2006,"Regularidad, Promoción",0,NaN,0,NaN
2,27,K5151,952054,NaN,Presencial,Noche,2006,"Promoción, Regularidad",0,NaN,0,NaN
3,27,K5152,952056,NaN,Presencial,Noche,2006,"Promoción, Regularidad",0,NaN,0,NaN
4,53,K4051,952046,NaN,Presencial,Noche,2010,"Regularidad, Promoción",0,NaN,0,NaN

In [8]:
dat.head()

,codigo_alumno,pais,localidad,provincia,titulo_secundario,estado_civil,sexo,año_nacimiento,año_ingreso,codigo_propuesta
0,4,NaN,NaN,NaN,NaN,Soltero,M,1974,1993,K
1,5,NaN,NaN,NaN,NaN,Soltero,M,1974,1993,K
2,6,NaN,NaN,NaN,NaN,Soltero,M,1974,1998,K
3,8,NaN,NaN,NaN,NaN,Soltero,M,1974,1994,K
4,9,NaN,NaN,NaN,NaN,Soltero,M,1974,1993,K

In [9]:
fin.head()

,codigo_alumno,codigo_materia,anio_academico,nota,aprobado,promociono,año_cursada
0,4,841346,1993.0,5,5,NaN,NaN
1,4,854003,1993.0,2,NaN,NaN,NaN
2,4,854005,1993.0,6,6,NaN,NaN
3,4,864013,1993.0,7,7,NaN,NaN
4,4,651302,1994.0,5,5,NaN,NaN

In [10]:
# cuantos alumnos en cada file
print(cur.codigo_alumno.nunique())
print(dat.codigo_alumno.nunique())
print(fin.codigo_alumno.nunique())

35626
84278
49017

In [11]:
cur.columns

Index(['codigo_alumno', 'curso', 'codigo_materia', 'departamento', 'modalidad',
       'turno', 'ciclo_lectivo', 'tipo_de_aprobacion',
       'cantidad_recursada_regular', 'descripción_recursada_regular',
       'cantidad_recursada_libre', 'descripción_de_recursada_libre'],
      dtype='object')

In [12]:
fin.columns

Index(['codigo_alumno', 'codigo_materia', 'anio_academico', 'nota', 'aprobado',
       'promociono', 'año_cursada'],
      dtype='object')

In [13]:
dat.columns

Index(['codigo_alumno', 'pais', 'localidad', 'provincia', 'titulo_secundario',
       'estado_civil', 'sexo', 'año_nacimiento', 'año_ingreso',
       'codigo_propuesta'],
      dtype='object')

## Reduccion de Dataset

In [17]:
df = pd.merge(cur, fin, how = 'inner', on = 'codigo_alumno')
df.shape

(17737116, 18)

In [18]:
df.codigo_alumno.nunique()

24830

In [19]:
df = pd.merge(df, dat, how= 'inner', on = 'codigo_alumno')
df.shape

(17748140, 27)

In [20]:
df.codigo_alumno.nunique()

24830

In [21]:
df = df.codigo_alumno.unique()

In [22]:
len(df)

24830

In [23]:
df = pd.DataFrame(df)

In [24]:
df.columns = ['codigo_alumno']

In [25]:
df

       codigo_alumno
0                 27
1                 53
2                 58
3                 72
4                 86
...              ...
24825          79993
24826          79994
24827          79995
24828          79997
24829          79999

[24830 rows x 1 columns]

In [26]:
datdf = pd.merge(df, dat, how= 'inner', on = 'codigo_alumno')
datdf.shape

(24839, 10)

In [30]:
curdf = pd.merge(df, cur, how= 'inner', on = 'codigo_alumno')
curdf.shape

(581295, 12)

In [29]:
findf = pd.merge(df, fin, how= 'inner', on = 'codigo_alumno')
findf.shape

(554523, 7)

### Guardar dataset reducidos

In [31]:
datdf.to_csv('../data/interim/datdf.csv', index = False)
curdf.to_csv('../data/interim/curdf.csv', index = False)
findf.to_csv('../data/interim/findf.csv', index = False)